# ShowBraceBelow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSettings..::..ShowBraceBelow Property
StructuralSettings Class See Also
---
Whether to show brace symbols below beams in plan views.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool ShowBraceBelow { get; set; }
```

Visual Basic
---
```text
Public Property ShowBraceBelow As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowBraceBelow {
	bool get ();
	void set (bool value);
}
```

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace